"""
Ввод-вывод
"""

# input - функция, ожидающая ввод от пользователя в интерактивной консоли
# функция передаёт управление скрипту после того как пользователь нажмёт enter
s = input('введите что нибудь: ')
# результат - всегда строка (если пользователь ничего не ввёл - пустая строка '')
print(f'вы ввели "{s}"')

# вывод - встроенная функция print
# print выведет в консоль в одну строку все переданные ей аргументы в той последовтельности, в какой ей передали
print('this', 'is', 1, 'chance', 2, 'stay', True)

# по умолчанию print заканчивает вывод переносом строки, это можно изменить с помошью ключевого аргумента end
print('БУ', end='')
print('РА', end='')
print('ТИ', end='')
print('НО')
