"""
Идентификаторы и ключевые слова

Идентификатор: название пакета, модуля, переменной, функции или класса
Ключевое слово: зарезервированное имя, которое нельзя использовать в качестве идентификатора
"""

# полный список зарезервированных ключевых слов
import keyword
print('зарезервированные идентификаторы (ключевые слова): ', keyword.kwlist)

# в названиях идентификаторов можно использовать буквы алфавита, underscore _ и цифры 0-9
# при этом нельзя начинать с цифр

# так нельзя
# 1var = False
# var-1 = False
# var.1 = False
# var.one = False
var_1 = True  # так можно

# по соглашению, приватные (нежелательные к использованию во внешних
# по отношению к этому пространствах имён) имена начинают с подчёркивания
_private_var = 'secret'

# константы записываются в верхнем регистре
MY_CONSTANT = 1

# названия пакетов, модулей, переменных, функций и методов записываются в нижнем регистре
my_var = []


# нижний регистр
def my_99_function():
    pass


# классы именуются CamelCase'ом
class MyClass:
    # методы - в нижнем регистре
    def foo_this_out(self):
        pass
