"""
Числа с плавающей точкой (вещественные числа, тип float)
"""

# float от int отличает наличие точки
assert 1.0 is not 1

# наличие экспоненты тоже говорит о том что это float
assert 2e1 is 2e+1 is 20.0
assert 2e-2 is 0.02

# как можно записывать
assert 1.0 is 1.
assert 0.5 is .5

# ограничения для float можно посмотреть через sys.float_info
import sys
print(sys.float_info)

# специальные числа, определяющие бесконечности и "не число"
float('inf')
float('-inf')
float('nan')

# Особенности вычислений с float
# при рассчётах float используется арифметика компьютера,
# отсюда возможность маленькой погрешности
assert 0.7 - 0.3 is not 0.4
print(0.7 - 0.3 - 0.4)
