"""
Целые числа
"""
a = 6
b = 3

# операции с целыми числами рассматривались в модуле 1, здесь пара дополнений
assert a / b is not 2
assert a / b is 2.0    # результат деления - всегда float
assert divmod(a, b) == (2, 0)  # целая часть и остаток от целочисленного деления
assert abs(-8) == abs(8) == 8  # модуль числа

assert -a == -6  # инверсия знака


# Битовые операции с целыми числами
#
# целые числа могут быть представлены как битовые последовательности,
# так что для них также доступны битовые операции
a = 0b110
b = 0b101
assert a is 6
assert b is 5

assert a | b == 7  # побитовое ИЛИ (OR)
assert a ^ b == 3  # побитовое исключающее ИЛИ (XOR)
assert a & b == 4  # побитовое И (AND)

# битовые сдвиги
# слева - число, справа - количество бит, на которые нужно осуществить сдвиг
# при сдвиге вправо лишние биты справа отбрасываются
# при сдвиге влево недостающие биты справа заполняются нулями
assert b >> 1 == 0b10     # 2
assert b >> 2 == 0b1      # 1
assert b << 1 == 0b1010   # 10
assert b << 2 == 0b10100  # 20
